Diffuser/SpalartAllmaras/0.orig/turbulenceProperties:R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 -0 -0 0 -0 0);

boundaryField
{
    lowerWall
    {
        type            calculated;
        value           uniform (0 -0 -0 0 -0 0);
    }
    upperWall
    {
        type            calculated;
        value           uniform (0 -0 -0 0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 -0 0 -0 0);
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
65
(
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
(0.0113137 -0 -0 0.0113137 -0 0.0113137)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
